# -*- mode: org; fill-column: 78; -*-
# Time-stamp: <2025-03-10 19:31:34 krylon>
#
#+TAGS: internals(i) ui(u) bug(b) feature(f)
#+TAGS: database(d) design(e), meditation(m)
#+TAGS: optimize(o) refactor(r) cleanup(c)
#+TODO: TODO(t)  RESEARCH(r) IMPLEMENT(i) TEST(e) | DONE(d) FAILED(f) CANCELLED(c)
#+TODO: MEDITATE(m) PLANNING(p) | SUSPENDED(s)
#+PRIORITIES: A G D

* kryLisp [3/7]
  :PROPERTIES:
  :COOKIE_DATA: todo recursive
  :VISIBILITY: children
  :END:
  A naive Lisp interpreter, written in Python.
** Clocktable
   #+BEGIN: clocktable :scope file :maxlevel 255 :emphasize t
   #+CAPTION: Clock summary at [2025-03-10 Mo 19:31]
   | Headline                | Time    |         |      |      |
   |-------------------------+---------+---------+------+------|
   | *Total time*            | *14:38* |         |      |      |
   |-------------------------+---------+---------+------+------|
   | *kryLisp [3/7]*         | *14:38* |         |      |      |
   | \_  /Components [1/3]/  |         | /14:38/ |      |      |
   | \_    Parser [1/1]      |         |         | 5:36 |      |
   | \_      Ditch the Atom  |         |         |      | 0:41 |
   | \_    Interpreter [0/0] |         |         | 9:02 |      |
   #+END:
** Features [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
** Components [1/3]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
*** TODO Parser [1/1]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-03-10 Mo 18:45]--[2025-03-10 Mo 18:46] =>  0:01
    CLOCK: [2024-05-19 So 17:33]--[2024-05-19 So 21:18] =>  3:45
    CLOCK: [2024-05-19 So 15:56]--[2024-05-19 So 17:05] =>  1:09
    :END:
**** DONE Ditch the Atom
     CLOSED: [2025-03-10 Mo 19:31]
     :LOGBOOK:
     CLOCK: [2025-03-10 Mo 18:50]--[2025-03-10 Mo 19:31] =>  0:41
     :END:
     The Atom type was a mistake, I should ditch it, and use plain str, int,
     float, and data.Symbol.
*** TODO Interpreter [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-03-08 Sa 16:24]--[2025-03-08 Sa 22:49] =>  6:25
    CLOCK: [2024-05-20 Mo 14:29]--[2024-05-20 Mo 17:06] =>  2:37
    :END:
** Bugs [2/4]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
*** TODO Linters to the rescue [2/3]
    I wrote a Lisp interpreter in Python many years ago (2010, apparently),
    and I am trying to copy some of the code, which makes the linters scream.
    The old code was written for Python 2, so ... no surprise there.
    So here's what I am going to do:
**** DONE Pacify the linters
     CLOSED: [2025-03-08 Sa 15:05]
     Fix everything the linters are barking at
**** DONE Add type hints
     CLOSED: [2025-03-08 Sa 15:05]
     Add type annotations, as far as possible and helpful
**** TODO Testing
     I should probably write some tests, too.
